apache/nuttx/arch/arm/src/nrf53/nrf53_spi.c
/* SPI1 */

#ifdef CONFIG_NRF53_SPI1_MASTER
static const struct spi_ops_s g_spi1ops =
{
  .lock              = nrf53_spi_lock,
  .select            = nrf53_spi1select,
  .setfrequency      = nrf53_spi_setfrequency,
  .setmode           = nrf53_spi_setmode,
  .setbits           = nrf53_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf53_spi_hwfeatures,
#  endif
  .status            = nrf53_spi1status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf53_spi1cmddata,
#  endif
  .send              = nrf53_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf53_spi_exchange,
#  else
  .sndblock          = nrf53_spi_sndblock,
  .recvblock         = nrf53_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf53_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf53_spi1register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf53_spidev_s g_spi1dev =
{
  .spidev    =
  {
    .ops     = &g_spi1ops,
  },

  .base      = NRF53_SPIM1_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF53_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF53_IRQ_SERIAL1,
#endif
  .sck_pin   = BOARD_SPI1_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

/* SPI2 */

#ifdef CONFIG_NRF53_SPI2_MASTER
static const struct spi_ops_s g_spi2ops =
{
  .lock              = nrf53_spi_lock,
  .select            = nrf53_spi2select,
  .setfrequency      = nrf53_spi_setfrequency,
  .setmode           = nrf53_spi_setmode,
  .setbits           = nrf53_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf53_spi_hwfeatures,
#  endif
  .status            = nrf53_spi2status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf53_spi2cmddata,
#  endif
  .send              = nrf53_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf53_spi_exchange,
#  else
  .sndblock          = nrf53_spi_sndblock,
  .recvblock         = nrf53_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf53_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf53_spi2register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf53_spidev_s g_spi2dev =
{
  .spidev    =
  {
    .ops     = &g_spi2ops,
  },

  .base      = NRF53_SPIM2_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF53_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF53_IRQ_SERIAL2,
#endif
  .sck_pin   = BOARD_SPI2_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

/* SPI3 */

#ifdef CONFIG_NRF53_SPI3_MASTER
static const struct spi_ops_s g_spi3ops =
{
  .lock              = nrf53_spi_lock,
  .select            = nrf53_spi3select,
  .setfrequency      = nrf53_spi_setfrequency,
  .setmode           = nrf53_spi_setmode,
  .setbits           = nrf53_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf53_spi_hwfeatures,
#  endif
  .status            = nrf53_spi3status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf53_spi3cmddata,
#  endif
  .send              = nrf53_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf53_spi_exchange,
#  else
  .sndblock          = nrf53_spi_sndblock,
  .recvblock         = nrf53_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf53_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf53_spi3register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf53_spidev_s g_spi3dev =
{
  .spidev    =
  {
    .ops     = &g_spi3ops,
  },

  .base      = NRF53_SPIM3_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF53_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF53_IRQ_SERIAL3,
#endif
  .sck_pin   = BOARD_SPI3_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

/* SPI4 */

#ifdef CONFIG_NRF53_SPI4_MASTER
static const struct spi_ops_s g_spi4ops =
{
  .lock              = nrf53_spi_lock,
  .select            = nrf53_spi4select,
  .setfrequency      = nrf53_spi_setfrequency,
  .setmode           = nrf53_spi_setmode,
  .setbits           = nrf53_spi_setbits,
#  ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = nrf53_spi_hwfeatures,
#  endif
  .status            = nrf53_spi4status,
#  ifdef CONFIG_SPI_CMDDATA
  .cmddata           = nrf53_spi4cmddata,
#  endif
  .send              = nrf53_spi_send,
#  ifdef CONFIG_SPI_EXCHANGE
  .exchange          = nrf53_spi_exchange,
#  else
  .sndblock          = nrf53_spi_sndblock,
  .recvblock         = nrf53_spi_recvblock,
#  endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = nrf53_spi_trigger,
#endif
#ifdef CONFIG_SPI_CALLBACK
  .registercallback  = nrf53_spi4register,  /* Provided externally */
#else
  .registercallback  = NULL,                /* Not implemented */
#endif
};

static struct nrf53_spidev_s g_spi4dev =
{
  .spidev    =
  {
    .ops     = &g_spi4ops,
  },

  .base      = NRF53_SPIM4_BASE,
  .lock      = NXMUTEX_INITIALIZER,
#ifdef CONFIG_NRF53_SPI_MASTER_INTERRUPTS
  .sem_isr   = SEM_INITIALIZER(0),
  .irq       = NRF53_IRQ_SPI4,
#endif
  .sck_pin   = BOARD_SPI4_SCK_PIN,
  .frequency = 0,
  .mode      = 0
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf53_spi_putreg
 *
 * Description:
 *   Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void nrf53_spi_putreg(struct nrf53_spidev_s *priv,
                                    uint32_t offset,
                                    uint32_t value)
{
  putreg32(value, priv->base + offset);
}

/****************************************************************************
 * Name: nrf53_spi_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t nrf53_spi_getreg(struct nrf53_spidev_s *priv,
                                        uint32_t offset)
{
  return getreg32(priv->base + offset);
}

/****************************************************************************
 * Name: nrf53_spi_isr
 *
 * Description:
 *   Common SPI interrupt service routine
 *
 ****************************************************************************/

#ifdef CONFIG_NRF53_SPI_MASTER_INTERRUPTS
static int nrf53_spi_isr(int irq, void *context, void *arg)
{
  struct nrf53_spidev_s *priv = (struct nrf53_spidev_s *)arg;

  /* Get interrupt event */

