apache/nuttx/arch/arm/src/nrf53/nrf53_spi.c
          return 0;
        }
    }
  else
    {
      /* We can always go to any other state */

      return 0;
    }
}

/****************************************************************************
 * Name: nrf53_spi_pm_notify
 ****************************************************************************/

static void nrf53_spi_pm_notify(struct pm_callback_s *cb, int domain,
                                enum pm_state_e pmstate)
{
  if (pmstate == PM_SLEEP || pmstate == PM_STANDBY)
    {
      /* Deinit SPI peripheral on each initialized device */

#ifdef CONFIG_NRF53_SPI0_MASTER
      if (g_spi0dev.initialized)
        {
          nrf53_spi_deinit(&g_spi0dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI1_MASTER
      if (g_spi1dev.initialized)
        {
          nrf53_spi_deinit(&g_spi1dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI2_MASTER
      if (g_spi2dev.initialized)
        {
          nrf53_spi_deinit(&g_spi2dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI3_MASTER
      if (g_spi3dev.initialized)
        {
          nrf53_spi_deinit(&g_spi3dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI4_MASTER
      if (g_spi4dev.initialized)
        {
          nrf53_spi_deinit(&g_spi4dev);
        }
#endif
    }
  else
    {
      /* Reinit SPI peripheral on each initialized device */

#ifdef CONFIG_NRF53_SPI0_MASTER
      if (g_spi0dev.initialized)
        {
          nrf53_spi_init(&g_spi0dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI1_MASTER
      if (g_spi1dev.initialized)
        {
          nrf53_spi_init(&g_spi1dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI2_MASTER
      if (g_spi2dev.initialized)
        {
          nrf53_spi_init(&g_spi2dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI3_MASTER
      if (g_spi3dev.initialized)
        {
          nrf53_spi_init(&g_spi3dev);
        }
#endif

#ifdef CONFIG_NRF53_SPI4_MASTER
      if (g_spi4dev.initialized)
        {
          nrf53_spi_init(&g_spi4dev);
        }
#endif
    }
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf53_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI port.
 *
 * Input Parameters:
 *   Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ****************************************************************************/

struct spi_dev_s *nrf53_spibus_initialize(int port)
{
  struct nrf53_spidev_s *priv = NULL;

  /* Get SPI driver data */

  switch (port)
    {
#ifdef CONFIG_NRF53_SPI0_MASTER
      case 0:
        {
          priv = &g_spi0dev;
          break;
        }
#endif

#ifdef CONFIG_NRF53_SPI1_MASTER
      case 1:
        {
          priv = &g_spi1dev;
          break;
        }
#endif

#ifdef CONFIG_NRF53_SPI2_MASTER
      case 2:
        {
          priv = &g_spi2dev;
          break;
        }
#endif

#ifdef CONFIG_NRF53_SPI3_MASTER
      case 3:
        {
          priv = &g_spi3dev;
          break;
        }
#endif

#ifdef CONFIG_NRF53_SPI4_MASTER
      case 4:
        {
          priv = &g_spi4dev;
          break;
        }
#endif

      default:
        {
          goto errout;
        }
    }

  /* Initialize the SPI */

  nrf53_spi_init(priv);

  /* Mark device as initialized */

  priv->initialized = true;

#ifdef CONFIG_NRF53_SPI_MASTER_INTERRUPTS
  /* Attach SPI interrupt */

  irq_attach(priv->irq, nrf53_spi_isr, priv);
  up_enable_irq(priv->irq);
#endif

errout:
  return (struct spi_dev_s *)priv;
}
